<a href="https://colab.research.google.com/github/sabiqu/-Application-and-Reproducible-Pitch/blob/master/Untitled4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd

In [5]:
track_subscription = pd.read_csv("/track_subscription_data.csv")
track_subscription.head()

   user_id      track_slug subscription_date
0        6      kerala-psc        2021-06-04
1        6            KTET        2021-06-04
2      608  spoken-english        2021-06-04
3      608           APPSC        2021-06-04
4      608   Eng_With_Awal        2021-06-04

In [43]:
user_purchase = pd.read_csv("/user_purchase_data.csv")
user_purchase.head()
user_purchase.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   user_uid                1000 non-null   int64
 1   date_joined             1000 non-null   object
 2   date_of_first_purhcase  576 non-null    object
dtypes: int64(1), object(2)
memory usage: 23.6+ KB

In [8]:
unpaid = user_purchase['date_of_first_purhcase'].isnull()

In [38]:
user_purchase['Paid_flag'] = user_purchase['date_of_first_purhcase'].notnull()
user_purchase.head()

   user_uid date_joined date_of_first_purhcase  ...       Date   Paid  Paid_flag
0         6  2021-06-04             2021-06-04  ... 2021-06-04   True       True
1       608  2021-06-04                    NaN  ...        NaT  False      False
2       635  2021-06-04                    NaN  ...        NaT  False      False
3       745  2021-06-04                    NaN  ...        NaT  False      False
4      1506  2021-06-04                    NaN  ...        NaT  False      False

[5 rows x 7 columns]

In [44]:
user_purchase["purchase_Date"] = pd.to_datetime(user_purchase["date_of_first_purhcase"])
user_purchase["join_Date"] = pd.to_datetime(user_purchase["date_joined"])
user_purchase.head()

   user_uid date_joined date_of_first_purhcase purchase_Date  join_Date
0         6  2021-06-04             2021-06-04    2021-06-04 2021-06-04
1       608  2021-06-04                    NaN           NaT 2021-06-04
2       635  2021-06-04                    NaN           NaT 2021-06-04
3       745  2021-06-04                    NaN           NaT 2021-06-04
4      1506  2021-06-04                    NaN           NaT 2021-06-04

In [46]:
user_purchase["Diffrenece"]=user_purchase["purchase_Date"].sub(user_purchase["join_Date"], axis=0)
user_purchase.head()

   user_uid date_joined  ...  join_Date Diffrenece
0         6  2021-06-04  ... 2021-06-04     0 days
1       608  2021-06-04  ... 2021-06-04        NaT
2       635  2021-06-04  ... 2021-06-04        NaT
3       745  2021-06-04  ... 2021-06-04        NaT
4      1506  2021-06-04  ... 2021-06-04        NaT

[5 rows x 6 columns]